In [3]:
pip install pandas

Requirement already satisfied: pandas in c:\program files\python311\lib\site-packages (2.2.3)
Requirement already satisfied: numpy>=1.23.2 in c:\program files\python311\lib\site-packages (from pandas) (2.2.5)
Requirement already satisfied: python-dateutil>=2.8.2 in c:\program files\python311\lib\site-packages (from pandas) (2.9.0.post0)
Requirement already satisfied: pytz>=2020.1 in c:\program files\python311\lib\site-packages (from pandas) (2025.2)
Requirement already satisfied: tzdata>=2022.7 in c:\program files\python311\lib\site-packages (from pandas) (2025.2)
Requirement already satisfied: six>=1.5 in c:\program files\python311\lib\site-packages (from python-dateutil>=2.8.2->pandas) (1.17.0)
Note: you may need to restart the kernel to use updated packages.

[notice] A new release of pip available: 22.3 -> 25.1
[notice] To update, run: python.exe -m pip install --upgrade pip

In [7]:
import pandas as pd

df=pd.read_csv(r"C:/Users/Administrator/Downloads/nyc_weather.csv")

In [11]:
df.head()

,EST,Temperature,DewPoint,Humidity,Sea Level PressureIn,VisibilityMiles,WindSpeedMPH,PrecipitationIn,CloudCover,Events,WindDirDegrees
0,1/1/2016,38,23,52,30.03,10,8.0,0,5,NaN,281
1,1/2/2016,36,18,46,30.02,10,7.0,0,3,NaN,275
2,1/3/2016,40,21,47,29.86,10,8.0,0,1,NaN,277
3,1/4/2016,25,9,44,30.05,10,9.0,0,3,NaN,345
4,1/5/2016,20,-3,41,30.57,10,5.0,0,0,NaN,333

In [12]:
df.head(10)

,EST,Temperature,DewPoint,Humidity,Sea Level PressureIn,VisibilityMiles,WindSpeedMPH,PrecipitationIn,CloudCover,Events,WindDirDegrees
0,1/1/2016,38,23,52,30.03,10,8.0,0,5,NaN,281
1,1/2/2016,36,18,46,30.02,10,7.0,0,3,NaN,275
2,1/3/2016,40,21,47,29.86,10,8.0,0,1,NaN,277
3,1/4/2016,25,9,44,30.05,10,9.0,0,3,NaN,345
4,1/5/2016,20,-3,41,30.57,10,5.0,0,0,NaN,333
5,1/6/2016,33,4,35,30.50,10,4.0,0,0,NaN,259
6,1/7/2016,39,11,33,30.28,10,2.0,0,3,NaN,293
7,1/8/2016,39,29,64,30.20,10,4.0,0,8,NaN,79
8,1/9/2016,44,38,77,30.16,9,8.0,T,8,Rain,76
9,1/10/2016,50,46,71,29.59,4,NaN,1.8,7,Rain,109

In [13]:
df.tail(30)

,EST,Temperature,DewPoint,Humidity,Sea Level PressureIn,VisibilityMiles,WindSpeedMPH,PrecipitationIn,CloudCover,Events,WindDirDegrees
1,1/2/2016,36,18,46,30.02,10,7.0,0,3,NaN,275
2,1/3/2016,40,21,47,29.86,10,8.0,0,1,NaN,277
3,1/4/2016,25,9,44,30.05,10,9.0,0,3,NaN,345
4,1/5/2016,20,-3,41,30.57,10,5.0,0,0,NaN,333
5,1/6/2016,33,4,35,30.50,10,4.0,0,0,NaN,259
6,1/7/2016,39,11,33,30.28,10,2.0,0,3,NaN,293
7,1/8/2016,39,29,64,30.20,10,4.0,0,8,NaN,79
8,1/9/2016,44,38,77,30.16,9,8.0,T,8,Rain,76
9,1/10/2016,50,46,71,29.59,4,NaN,1.8,7,Rain,109
10,1/11/2016,33,8,37,29.92,10,NaN,0,1,NaN,289
11,1/12/2016,35,15,53,29.85,10,6.0,T,4,NaN,235
12,1/13/2016,26,4,42,29.94,10,10.0,0,0,NaN,284
13,1/14/2016,30,12,47,29.95,10,5.0,T,7,NaN,266
14,1/15/2016,43,31,62,29.82,9,5.0,T,2,NaN,101
15,1/16/2016,47,37,70,29.52,8,7.0,0.24,7,Rain,340
16,1/17/2016,36,23,66,29.78,8,6.0,0.05,6,Fog-Snow,345
17,1/18/2016,25,6,53,29.83,9,12.0,T,2,Snow,293
18,1/19/2016,22,3,42,30.03,10,11.0,0,1,NaN,293
19,1/20/2016,32,15,49,30.13,10,6.0,0,2,NaN,302
20,1/21/2016,31,11,45,30.15,10,6.0,0,1,NaN,312
21,1/22/2016,26,6,41,30.21,9,NaN,0.01,3,Snow,34
22,1/23/2016,26,21,78,29.77,1,16.0,2.31,8,Fog-Snow,42
23,1/24/2016,28,11,53,29.92,8,6.0,T,3,Snow,327
24,1/25/2016,34,18,54,30.25,10,3.0,0,2,NaN,286
25,1/26/2016,43,29,56,30.03,10,7.0,0,2,NaN,244
26,1/27/2016,41,22,45,30.03,10,7.0,T,3,Rain,311
27,1/28/2016,37,20,51,29.90,10,5.0,0,1,NaN,234
28,1/29/2016,36,21,50,29.58,10,8.0,0,4,NaN,298
29,1/30/2016,34,16,46,30.01,10,7.0,0,0,NaN,257
30,1/31/2016,46,28,52,29.90,10,5.0,0,0,NaN,241

In [14]:
df.Events

0          NaN
1          NaN
2          NaN
3          NaN
4          NaN
5          NaN
6          NaN
7          NaN
8         Rain
9         Rain
10         NaN
11         NaN
12         NaN
13         NaN
14         NaN
15        Rain
16    Fog-Snow
17        Snow
18         NaN
19         NaN
20         NaN
21        Snow
22    Fog-Snow
23        Snow
24         NaN
25         NaN
26        Rain
27         NaN
28         NaN
29         NaN
30         NaN
Name: Events, dtype: object

In [15]:
df.Humidity

0     52
1     46
2     47
3     44
4     41
5     35
6     33
7     64
8     77
9     71
10    37
11    53
12    42
13    47
14    62
15    70
16    66
17    53
18    42
19    49
20    45
21    41
22    78
23    53
24    54
25    56
26    45
27    51
28    50
29    46
30    52
Name: Humidity, dtype: int64

In [16]:
df.columns

Index(['EST', 'Temperature', 'DewPoint', 'Humidity', 'Sea Level PressureIn',
       'VisibilityMiles', 'WindSpeedMPH', 'PrecipitationIn', 'CloudCover',
       'Events', 'WindDirDegrees'],
      dtype='object')

In [17]:
df.count

<bound method DataFrame.count of           EST  Temperature  DewPoint  Humidity  Sea Level PressureIn  \
0    1/1/2016           38        23        52                 30.03
1    1/2/2016           36        18        46                 30.02
2    1/3/2016           40        21        47                 29.86
3    1/4/2016           25         9        44                 30.05
4    1/5/2016           20        -3        41                 30.57
5    1/6/2016           33         4        35                 30.50
6    1/7/2016           39        11        33                 30.28
7    1/8/2016           39        29        64                 30.20
8    1/9/2016           44        38        77                 30.16
9   1/10/2016           50        46        71                 29.59
10  1/11/2016           33         8        37                 29.92
11  1/12/2016           35        15        53                 29.85
12  1/13/2016           26         4        42                 29.94
13  1/14/2016           30        12        47                 29.95
14  1/15/2016           43        31        62                 29.82
15  1/16/2016           47        37        70                 29.52
16  1/17/2016           36        23        66                 29.78
17  1/18/2016           25         6        53                 29.83
18  1/19/2016           22         3        42                 30.03
19  1/20/2016           32        15        49                 30.13
20  1/21/2016           31        11        45                 30.15
21  1/22/2016           26         6        41                 30.21
22  1/23/2016           26        21        78                 29.77
23  1/24/2016           28        11        53                 29.92
24  1/25/2016           34        18        54                 30.25
25  1/26/2016           43        29        56                 30.03
26  1/27/2016           41        22        45                 30.03
27  1/28/2016           37        20        51                 29.90
28  1/29/2016           36        21        50                 29.58
29  1/30/2016           34        16        46                 30.01
30  1/31/2016           46        28        52                 29.90

    VisibilityMiles  WindSpeedMPH PrecipitationIn  CloudCover    Events  \
0                10           8.0               0           5       NaN
1                10           7.0               0           3       NaN
2                10           8.0               0           1       NaN
3                10           9.0               0           3       NaN
4                10           5.0               0           0       NaN
5                10           4.0               0           0       NaN
6                10           2.0               0           3       NaN
7                10           4.0               0           8       NaN
8                 9           8.0               T           8      Rain
9                 4           NaN             1.8           7      Rain
10               10           NaN               0           1       NaN
11               10           6.0               T           4       NaN
12               10          10.0               0           0       NaN
13               10           5.0               T           7       NaN
14                9           5.0               T           2       NaN
15                8           7.0            0.24           7      Rain
16                8           6.0            0.05           6  Fog-Snow
17                9          12.0               T           2      Snow
18               10          11.0               0           1       NaN
19               10           6.0               0           2       NaN
20               10           6.0               0           1       NaN
21                9           NaN            0.01           3      Snow
22                1          16.0            2.31           8  Fog-Snow
23                8           6.0               T           3      Snow
24               10           3.0               0           2       NaN
25               10           7.0               0           2       NaN
26               10           7.0               T           3      Rain
27               10           5.0               0           1       NaN
28               10           8.0               0           4       NaN
29               10           7.0               0           0       NaN
30               10           5.0               0           0       NaN

    WindDirDegrees
0              281
1              275
2              277
3              345
4              333
5              259
6              293
7               79
8               76
9              109
10             289
11             235
12             284
13             266
14             101
15             340
16             345
17             293
18             293
19             302
20             312
21              34
22              42
23             327
24             286
25             244
26             311
27             234
28             298
29             257
30             241  >

In [18]:
df.Temperature.count

<bound method Series.count of 0     38
1     36
2     40
3     25
4     20
5     33
6     39
7     39
8     44
9     50
10    33
11    35
12    26
13    30
14    43
15    47
16    36
17    25
18    22
19    32
20    31
21    26
22    26
23    28
24    34
25    43
26    41
27    37
28    36
29    34
30    46
Name: Temperature, dtype: int64>

In [19]:
df.describe()

,Temperature,DewPoint,Humidity,Sea Level PressureIn,VisibilityMiles,WindSpeedMPH,CloudCover,WindDirDegrees
count,31.000000,31.000000,31.000000,31.000000,31.000000,28.000000,31.000000,31.000000
mean,34.677419,17.838710,51.677419,29.992903,9.193548,6.892857,3.129032,247.129032
std,7.639315,11.378626,11.634395,0.237237,1.939405,2.871821,2.629853,92.308086
min,20.000000,-3.000000,33.000000,29.520000,1.000000,2.000000,0.000000,34.000000
25%,29.000000,10.000000,44.500000,29.855000,9.000000,5.000000,1.000000,238.000000
50%,35.000000,18.000000,50.000000,30.010000,10.000000,6.500000,3.000000,281.000000
75%,39.500000,23.000000,55.000000,30.140000,10.000000,8.000000,4.500000,300.000000
max,50.000000,46.000000,78.000000,30.570000,10.000000,16.000000,8.000000,345.000000

In [20]:
df.count()

EST                     31
Temperature             31
DewPoint                31
Humidity                31
Sea Level PressureIn    31
VisibilityMiles         31
WindSpeedMPH            28
PrecipitationIn         31
CloudCover              31
Events                   9
WindDirDegrees          31
dtype: int64

In [21]:
df.Temperature.count()

np.int64(31)

In [23]:
df.shape

(31, 11)

In [24]:
df.WindSpeedMPH

0      8.0
1      7.0
2      8.0
3      9.0
4      5.0
5      4.0
6      2.0
7      4.0
8      8.0
9      NaN
10     NaN
11     6.0
12    10.0
13     5.0
14     5.0
15     7.0
16     6.0
17    12.0
18    11.0
19     6.0
20     6.0
21     NaN
22    16.0
23     6.0
24     3.0
25     7.0
26     7.0
27     5.0
28     8.0
29     7.0
30     5.0
Name: WindSpeedMPH, dtype: float64

In [49]:
df.WindSpeedMPH.isna()

0     False
1     False
2     False
3     False
4     False
5     False
6     False
7     False
8     False
9      True
10     True
11    False
12    False
13    False
14    False
15    False
16    False
17    False
18    False
19    False
20    False
21     True
22    False
23    False
24    False
25    False
26    False
27    False
28    False
29    False
30    False
Name: WindSpeedMPH, dtype: bool

In [28]:
df.dtypes

EST                      object
Temperature               int64
DewPoint                  int64
Humidity                  int64
Sea Level PressureIn    float64
VisibilityMiles           int64
WindSpeedMPH            float64
PrecipitationIn          object
CloudCover                int64
Events                   object
WindDirDegrees            int64
dtype: object

In [29]:
df.Events.unique()

array([nan, 'Rain', 'Fog-Snow', 'Snow'], dtype=object)

In [30]:
df.Events.describe()

count        9
unique       3
top       Rain
freq         4
Name: Events, dtype: object

In [31]:
df.Events

0          NaN
1          NaN
2          NaN
3          NaN
4          NaN
5          NaN
6          NaN
7          NaN
8         Rain
9         Rain
10         NaN
11         NaN
12         NaN
13         NaN
14         NaN
15        Rain
16    Fog-Snow
17        Snow
18         NaN
19         NaN
20         NaN
21        Snow
22    Fog-Snow
23        Snow
24         NaN
25         NaN
26        Rain
27         NaN
28         NaN
29         NaN
30         NaN
Name: Events, dtype: object

In [36]:
df['Temperature'].max()

np.int64(50)

In [37]:
df['Temperature'].min()

np.int64(20)

In [38]:
df.Temperature.min()

np.int64(20)

In [39]:
df1=df['Temperature']>30
df1

0      True
1      True
2      True
3     False
4     False
5      True
6      True
7      True
8      True
9      True
10     True
11     True
12    False
13    False
14     True
15     True
16     True
17    False
18    False
19     True
20     True
21    False
22    False
23    False
24     True
25     True
26     True
27     True
28     True
29     True
30     True
Name: Temperature, dtype: bool

In [41]:
df1.sum()
df1.head()

0     True
1     True
2     True
3    False
4    False
Name: Temperature, dtype: bool

In [44]:
df['EST'][df['Events']=='Rain']

8      1/9/2016
9     1/10/2016
15    1/16/2016
26    1/27/2016
Name: EST, dtype: object

In [45]:
df['EST'][df['Humidity']==70]

15    1/16/2016
Name: EST, dtype: object

In [46]:
df['EST'][df['Humidity']>=70]

8      1/9/2016
9     1/10/2016
15    1/16/2016
22    1/23/2016
Name: EST, dtype: object

In [47]:
df['EST'][df['WindSpeedMPH']==7.0]

1      1/2/2016
15    1/16/2016
25    1/26/2016
26    1/27/2016
29    1/30/2016
Name: EST, dtype: object

In [48]:
df['Events'][df['WindSpeedMPH']==7.0]

1      NaN
15    Rain
25     NaN
26    Rain
29     NaN
Name: Events, dtype: object

In [50]:
df['Events'][df['Events'].isna()]

0     NaN
1     NaN
2     NaN
3     NaN
4     NaN
5     NaN
6     NaN
7     NaN
10    NaN
11    NaN
12    NaN
13    NaN
14    NaN
18    NaN
19    NaN
20    NaN
24    NaN
25    NaN
27    NaN
28    NaN
29    NaN
30    NaN
Name: Events, dtype: object

In [51]:
ls=[10,20,30,40,50]
s=pd.Series(ls)

In [53]:
print(s,type(s))

0    10
1    20
2    30
3    40
4    50
dtype: int64 <class 'pandas.core.series.Series'>

In [56]:
lst=[1,2,3]
s=pd.Series(lst,index=("1st",2,"3rd"),name='c')
print(s)

1st    1
2      2
3rd    3
Name: c, dtype: int64

In [62]:
s1=pd.Series([10,20,30,40,50,60])
print(s1,type(s1))

0    10
1    20
2    30
3    40
4    50
5    60
dtype: int64 <class 'pandas.core.series.Series'>

In [63]:
print(s1.loc[0:4])

0    10
1    20
2    30
3    40
4    50
dtype: int64

In [67]:
l=(10,20,30,40,50,60)
s=pd.Series(l,dtype='float32')
print(s,type(s))

0    10.0
1    20.0
2    30.0
3    40.0
4    50.0
5    60.0
dtype: float32 <class 'pandas.core.series.Series'>

In [68]:
s[3]

np.float32(40.0)

In [69]:
s.shape

(6,)

In [70]:
q=[10,"aze",10.0,"student"]
se=pd.Series(q,index=["id","name","mark","des"])

In [72]:
print(se,type(se))

id           10
name        aze
mark       10.0
des     student
dtype: object <class 'pandas.core.series.Series'>

In [73]:
se["id"]

10

In [74]:
dic={"sub1":"c","sub2":"python","sub3":"c++","sub4":"java"}
print(dic,type(dic))

{'sub1': 'c', 'sub2': 'python', 'sub3': 'c++', 'sub4': 'java'} <class 'dict'>

In [75]:
dic.items()

dict_items([('sub1', 'c'), ('sub2', 'python'), ('sub3', 'c++'), ('sub4', 'java')])

In [77]:
dic.keys()

dict_keys(['sub1', 'sub2', 'sub3', 'sub4'])

In [78]:
dic.values()

dict_values(['c', 'python', 'c++', 'java'])

In [79]:
dic={"sub1":"c","sub2":"python","sub3":"c++","sub4":"java"}
print(dic)

{'sub1': 'c', 'sub2': 'python', 'sub3': 'c++', 'sub4': 'java'}

In [80]:
s=pd.Series(dic)
print(s)

sub1         c
sub2    python
sub3       c++
sub4      java
dtype: object

In [81]:
s['sub2']

'python'

In [82]:
l=[[1,9,7],[3,5,6],[9,8,0]]
d=pd.Series(l)
print(d)

0    [1, 9, 7]
1    [3, 5, 6]
2    [9, 8, 0]
dtype: object

In [ ]:
HERE WE GET IN RC FORMAT

In [84]:
l=[[10,'rs'],[1,'ac'],[2,'tra'],[3,'mca']]
df=pd.DataFrame(l)
print(df)

    0    1
0  10   rs
1   1   ac
2   2  tra
3   3  mca

In [85]:
df.iloc[1:,:]

   0    1
1  1   ac
2  2  tra
3  3  mca

In [87]:
df.iloc[3,1]

'mca'

In [90]:
l=[[10,'rs'],[1,'ac'],[2,'tra'],[3,'mca']]
df=pd.DataFrame(l,columns=["rno",'branch'],index=["no1","no2","no3","no4"])
print(df)

     rno branch
no1   10     rs
no2    1     ac
no3    2    tra
no4    3    mca

In [92]:
df.loc["no1","rno"]

np.int64(10)

In [21]:
tp=(("rossum",20),("azeya",10),("devu",90))
d=pd.DataFrame(tp,index=[1,'@',3,],columns=["name","mark"])
print(d)

     name  mark
1  rossum    20
@   azeya    10
3    devu    90

In [22]:
d['salary']=[100,200,300]
d

     name  mark  salary
1  rossum    20     100
@   azeya    10     200
3    devu    90     300

In [23]:
d.drop(1,axis=0,inplace=True)

In [24]:
d

    name  mark  salary
@  azeya    10     200
3   devu    90     300

In [25]:
d.drop('salary',axis=1,inplace=True)
d

    name  mark
@  azeya    10
3   devu    90

In [26]:
dictdata={"names":["aze","amina","devu"],"subjectmark":[10,20,30],"ages":[12,21,23]}
print(dictdata)

{'names': ['aze', 'amina', 'devu'], 'subjectmark': [10, 20, 30], 'ages': [12, 21, 23]}

In [27]:
d=pd.DataFrame(dictdata)
print(d)

   names  subjectmark  ages
0    aze           10    12
1  amina           20    21
2   devu           30    23

In [28]:
l=[1,2,34]
sdata=pd.Series(l)
print(type(sdata))

<class 'pandas.core.series.Series'>

In [29]:
print(sdata)

0     1
1     2
2    34
dtype: int64

In [30]:
df=pd.DataFrame(sdata,columns=["number"])
df

   number
0       1
1       2
2      34

In [31]:
df.shape

(3, 1)

In [32]:
type(df)

pandas.core.frame.DataFrame

In [40]:
s=pd.Series([1,2,3])
d=pd.DataFrame(s,columns=["marks"])
print(d)

   marks
0      1
1      2
2      3

In [42]:
d1={"totalmark":[100,200,150],"obtmark":[70,70,90]}
print(d1)

{'totalmark': [100, 200, 150], 'obtmark': [70, 70, 90]}

In [43]:
p=pd.DataFrame(d1,index=[1,2,3])
print(p)

   totalmark  obtmark
1        100       70
2        200       70
3        150       90

In [46]:
p.iloc[2:,:]

   totalmark  obtmark
3        150       90

In [47]:
p['c3']=p['totalmark']+p['obtmark']
p

   totalmark  obtmark   c3
1        100       70  170
2        200       70  270
3        150       90  240

In [48]:
p['c4']=p['totalmark']-p['obtmark']
print(p)

   totalmark  obtmark   c3   c4
1        100       70  170   30
2        200       70  270  130
3        150       90  240   60

In [49]:
p['new_column']=[1,2,3]
print(p)

   totalmark  obtmark   c3   c4  new_column
1        100       70  170   30           1
2        200       70  270  130           2
3        150       90  240   60           3

In [50]:
p['newdata']=['a','b','c']
print(p)

   totalmark  obtmark   c3   c4  new_column newdata
1        100       70  170   30           1       a
2        200       70  270  130           2       b
3        150       90  240   60           3       c

In [56]:
p['rolno']= range(1,4)
print(p)

   totalmark  obtmark   c3   c4  new_column newdata  rolno
1        100       70  170   30           1       a      1
2        200       70  270  130           2       b      2
3        150       90  240   60           3       c      3

In [59]:
p=p[[ 'obtmark','c3','new_column','c4','newdata','rolno','totalmark' ]]
print(p)

   obtmark   c3  new_column   c4 newdata  rolno  totalmark
1       70  170           1   30       a      1        100
2       70  270           2  130       b      2        200
3       90  240           3   60       c      3        150

In [60]:
d2={"name":["aze","devu","amina"],"mark":[70,70,90]}
print(d2)

{'name': ['aze', 'devu', 'amina'], 'mark': [70, 70, 90]}

In [61]:
p2=pd.DataFrame(d2,index=[1,2,3])
print(p2)

    name  mark
1    aze    70
2   devu    70
3  amina    90

In [62]:
p2=p2.sort_values("name",ascending=True)
print(p2)

    name  mark
3  amina    90
1    aze    70
2   devu    70

In [65]:
p2=p2.sort_values("mark",ascending=False)
print(p2)

    name  mark
3  amina    90
1    aze    70
2   devu    70